
&НаСервере
Процедура ПолучитьСписокДокументовОтВебСервиса()//Ден  2017 10 03 ---
	СписокДокументов.Очистить();	
	Попытка
		ОпределениеWS = Новый WSОпределения("http://localhost/TestBase/ws/mobile_erp?wsdl","IT","");
		Прокси = Новый WSПрокси(ОпределениеWS, "http://www.galamart.org/mobile_erp", "mobile_erp", "mobile_erpSoap");
		Прокси.Пользователь = "IT";
		Прокси.Пароль = "";
	Исключение
		Сообщить("Ошибка соединения с сервером!");
		Возврат;
	КонецПопытки;
	
	Если НЕ Прокси = Неопределено Тогда
		СписокДокументовXML = Прокси.GetReconciliationList();	
	КонецЕсли;
	
	Если ТипЗнч(СписокДокументовXML) <> тип("Строка") или СписокДокументовXML = "" Тогда
		Сообщить("Не удалось получить данные списка документов от сервера!");
		Возврат;
	КонецЕсли;
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(СписокДокументовXML);
	СписокДокументовОтСервера = СериализаторXDTO.ПрочитатьXML(ЧтениеХМЛ);
	ЧтениеХМЛ.Закрыть();
	
	Для Каждого СтрокаДокументов из СписокДокументовОтСервера Цикл
		ЗаполнитьЗначенияСвойств(СписокДокументов.Добавить(),СтрокаДокументов);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)//Ден  2017 10 03 ---
	ПолучитьСписокДокументовОтВебСервиса();
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)//Ден  2017 10 04 ---
	ДанныеТекущейСтроки = элементы.СписокДокументов.ТекущиеДанные;
	Если ДанныеТекущейСтроки <> Неопределено и ДанныеТекущейСтроки.ДокументUID <> "" Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаДокументаДляВизирования",новый Структура("ДокументUID",ДанныеТекущейСтроки.ДокументUID),,,,,новый ОписаниеОповещения("ПриЗакрытииФормыДокумента",ЭтотОбъект));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыДокумента(Результат,ДополнительныеПараметры) Экспорт//Ден  2017 10 04 ---
	Если ЗначениеЗаполнено(Результат) Тогда
		МассивУдаляемойСтроки = СписокДокументов.НайтиСтроки(новый структура("ДокументUID",Результат));
		Если МассивУдаляемойСтроки.количество() Тогда
			СписокДокументов.Удалить(МассивУдаляемойСтроки[0]);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

