
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Если Параметры.Свойство("ДокументUID") = Ложь или Параметры.ДокументUID = "" Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ДокументUID = Параметры.ДокументUID;
	
	Попытка
		ОпределениеWS = Новый WSОпределения("http://localhost/TestBase/ws/mobile_erp?wsdl","IT","");
		Прокси = Новый WSПрокси(ОпределениеWS, "http://www.galamart.org/mobile_erp", "mobile_erp", "mobile_erpSoap");
		Прокси.Пользователь = "IT";
		Прокси.Пароль = "";
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	Если НЕ Прокси = Неопределено Тогда
		ЦепочкаСогласованияXML = Прокси.GetReconciliationChain(ДокументUID);	
	КонецЕсли;
	
	Если ТипЗнч(ЦепочкаСогласованияXML) <> тип("Строка") или ЦепочкаСогласованияXML = "" Тогда
		Сообщить("Не удалось получить данные списка документов от сервера! ");
	КонецЕсли;
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(ЦепочкаСогласованияXML);
	ЦепочкаСогласования = СериализаторXDTO.ПрочитатьXML(ЧтениеХМЛ);
	ЧтениеХМЛ.Закрыть();
	
	Для Каждого СтрокаВизы из ЦепочкаСогласования Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСогласования.Добавить(),СтрокаВизы);
	КонецЦикла;
КонецПроцедуры
