
&НаСервереБезКонтекста
Функция УстановитьРешениеНаНаСервере(ВидРешения,UIDЗаявки)//Ден  2017 10 03 ---
	Попытка
		ОпределениеWS = Новый WSОпределения("http://localhost/TestBase/ws/mobile_erp?wsdl","IT","");
		Прокси = Новый WSПрокси(ОпределениеWS, "http://www.galamart.org/mobile_erp", "mobile_erp", "mobile_erpSoap");
		Прокси.Пользователь = "IT";
		Прокси.Пароль = "";
	Исключение
		Возврат "Ошибка соединения с сервером!";
	КонецПопытки;
		
	Если НЕ Прокси = Неопределено Тогда	
		Если ВидРешения = "Согласовано" Тогда
			РезультатУстановкиРешения = Прокси.СonfirmDocument(UIDЗаявки);
		ИначеЕсли ВидРешения = "Отклонено" Тогда 
			РезультатУстановкиРешения = Прокси.DeclineDocument(UIDЗаявки);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(РезультатУстановкиРешения) <> тип("Строка") или РезультатУстановкирешения = "" Тогда
		Возврат "Не удалось получить данные от сервера!";
	КонецЕсли;
	
	Возврат РезультатУстановкиРешения;		                                          
КонецФункции

&НаКлиенте
Процедура Отклонить(Команда)//Ден  2017 10 03 ---
	РезультатУстановкиРешения = УстановитьРешениеНаНаСервере("Отклонено",ДокументUID);
	Если РезультатУстановкиРешения = "Успешно" Тогда
		Закрыть(ДокументUID);	
	Иначе
		Сообщить("Ошибка при установке визы! " + РезультатУстановкиРешения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)//Ден  2017 10 03 ---
	РезультатУстановкиРешения = УстановитьРешениеНаНаСервере("Согласовано",ДокументUID);
	Если РезультатУстановкиРешения = "Успешно" Тогда
		Закрыть(ДокументUID);	
	Иначе
		Сообщить("Ошибка при установке визы! " + РезультатУстановкиРешения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)//Ден  2017 10 03 ---
	Если Параметры.Свойство("ДокументUID") = Ложь или Параметры.ДокументUID = "" Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ДокументUID = Параметры.ДокументUID;
	
	Попытка
		ОпределениеWS = Новый WSОпределения("http://localhost/TestBase/ws/mobile_erp?wsdl","IT","");
		Прокси = Новый WSПрокси(ОпределениеWS, "http://www.galamart.org/mobile_erp", "mobile_erp", "mobile_erpSoap");
		Прокси.Пользователь = "IT";
		Прокси.Пароль = "";
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	Если НЕ Прокси = Неопределено Тогда
		ДанныеДокументаXML = Прокси.GetReconciliationDocument(ДокументUID);	
	КонецЕсли;
	
	Если ТипЗнч(ДанныеДокументаXML) <> тип("Строка") или ДанныеДокументаXML = "" Тогда
		Сообщить("Не удалось получить данные списка документов от сервера! ");
	КонецЕсли;
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(ДанныеДокументаXML);
	ДанныеДокумента = СериализаторXDTO.ПрочитатьXML(ЧтениеХМЛ);
	ЧтениеХМЛ.Закрыть();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеДокумента);
	Для Каждого ДанныеСервераПозиция из ДанныеДокумента.МассивПозиций Цикл
		ЗаполнитьЗначенияСвойств(Позиции.Добавить(),ДанныеСервераПозиция);
	КонецЦикла;
	Элементы.ДатаНомер.Заголовок = Номер + " от " + формат(Дата,"ДФ=dd.MM.yyyy");
КонецПроцедуры
